[
  {
    "id": 1,
    "challenge": "1. I am your daddy, I'll take you to space; One of my projects is Boring; Answer with my name and I'll take you cruising in my awesome Model S.\nAsk around for the puzzle when you find me!",
    "answer": "elon musk",
    "hint": "My cars always fall in love with pigeons",
    "points": 50
  },
  {
    "id": 2,
    "challenge": "2. I am a famous nebula, hiding in the bull's horns. What's my name and M number?",
    "answer": "crab nebula m1",
    "hint": "I share my name with Spongebob's favourite restaurant",
    "points": 50
  },
  {
    "id": 3,
    "challenge": "3. I'm not too hot and not too cold, the only zone where life will hold. Get closer to the sun and burn, get further and become an icicle. What is my name?",
    "answer": "goldilocks zone",
    "hint": "Bears don't really like me",
    "points": 50
  },
  {
    "id": 4,
    "challenge": "4. I was first called LGM,and they thought they found aliens, but I'm just a dense, small mass of neutrons. What am I?",
    "answer": "pulsar",
    "hint": "I pulse, darling",
    "points": 50
  },
  {
    "id": 5,
    "challenge": "5. Old and reliable, I always point through stars and my typing is static. I have no objects, but I'm always structured. What's my name?",
    "answer": "C",
    "hint": "Pointer to pointer to pointer points to me",
    "points": 60
  },
  {
    "id": 6,
    "challenge": "6. I'm your hot coffee, robust and classy, it takes half the lines of code if you write me in Python",
    "answer": "Java",
    "hint": "I'm oriented to objects",
    "points": 50
  },
  {
    "id": 7,
    "challenge": "7. Trusssst in me...\n Simple is better than complex, \n Trusssst in me...\n Dynamic typing is better...\n Trusssst in me...\n Don't ever forget to indent me!",
    "answer": "Python",
    "hint": "Find me in the jungle",
    "points": 50
  },
  {
    "id": 8,
    "challenge": "8. I only answer yes or no, my roots are in first order logic; If you feel like crying, try writing your code with me.",
    "answer": "Prolog",
    "hint": "I am a declarative programming language",
    "points": 60
  },
  {
    "id": 9,
    "challenge": "9. I'm the Greek brother of Sleipnir, up high in the sky, go Google my name and find my brightest alpha star",
    "answer": "Markab",
    "hint": "I have magical powers and wings, and the answer to my riddle is hidden in the stars",
    "points": 60
  },
  {
    "id": 10,
    "challenge": "10. Look up in the sky, past time and date, spot the hidden star to find the next key",
    "answer": "timeanddate.com",
    "hint": "tick tock, the end is drawing near",
    "points": 50
  },
  {
    "id": 11,
    "challenge": "11. I'm the head of the small bear and I am not the brightest, but everyone in Hollywood thinks I show the right way. Who am I?",
    "answer": "North Star",
    "hint": "The Pole gives you the name",
    "points": 50
  },
  {
    "id": 12,
    "challenge": "12. I'm glowing in Greek, brightest in the night, I'm brother to all dogs, and spent some time in Azkaban.",
    "answer": "Sirius",
    "hint": "I did not betray Lily and James",
    "points": 50
  },
  {
    "id": 13,
    "challenge": "13. In the late hours of night, sitting by the cold campfire, follow the starts to get to the next challenge",
    "answer": "explore",
    "hint": "It all starts in a quiet place",
    "points": 50
  }
]
